{"format": "keras", "nodes": [{"name": "input_2", "id": "input_2", "class_name": "InputLayer", "output_shape": [[null, 256, 256, 3]], "num_parameters": 0}, {"name": "sequential", "id": "sequential", "class_name": "Sequential", "output_shape": [null, 256, 256, 3], "num_parameters": 0}, {"name": "tf.math.truediv", "id": "tf.math.truediv", "class_name": "TFOpLambda", "output_shape": [null, 256, 256, 3], "num_parameters": 0}, {"name": "tf.math.subtract", "id": "tf.math.subtract", "class_name": "TFOpLambda", "output_shape": [null, 256, 256, 3], "num_parameters": 0}, {"name": "inception_resnet_v2", "id": "inception_resnet_v2", "class_name": "Functional", "output_shape": [null, 6, 6, 1536], "num_parameters": 54336736}, {"name": "global_average_pooling2d", "id": "global_average_pooling2d", "class_name": "GlobalAveragePooling2D", "output_shape": [null, 1536], "num_parameters": 0}, {"name": "dropout", "id": "dropout", "class_name": "Dropout", "output_shape": [null, 1536], "num_parameters": 0}, {"name": "dense", "id": "dense", "class_name": "Dense", "output_shape": [null, 10], "num_parameters": 15370}], "edges": [["input_2", "sequential"], ["sequential", "tf.math.truediv"], ["tf.math.truediv", "tf.math.subtract"], ["tf.math.subtract", "inception_resnet_v2"], ["inception_resnet_v2", "global_average_pooling2d"], ["global_average_pooling2d", "dropout"], ["dropout", "dense"]]}